Masmiseim36/nxpSDK/middleware/mcu-boot/targets/MKV46F16/src/startup/gcc/startup_MKV46F16.S
/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro def_irq_handler  handler_name
    .weak \handler_name
    .set  \handler_name, DefaultISR
    .endm

/* Exception Handlers */
    def_irq_handler    MemManage_Handler
    def_irq_handler    BusFault_Handler
    def_irq_handler    UsageFault_Handler
    def_irq_handler    DebugMon_Handler
    def_irq_handler    DMA0_DriverIRQHandler
    def_irq_handler    DMA1_DriverIRQHandler
    def_irq_handler    DMA2_DriverIRQHandler
    def_irq_handler    DMA3_DriverIRQHandler
    def_irq_handler    DMA4_DriverIRQHandler
    def_irq_handler    DMA5_DriverIRQHandler
    def_irq_handler    DMA6_DriverIRQHandler
    def_irq_handler    DMA7_DriverIRQHandler
    def_irq_handler    DMA8_DriverIRQHandler
    def_irq_handler    DMA9_DriverIRQHandler
    def_irq_handler    DMA10_DriverIRQHandler
    def_irq_handler    DMA11_DriverIRQHandler
    def_irq_handler    DMA12_DriverIRQHandler
    def_irq_handler    DMA13_DriverIRQHandler
    def_irq_handler    DMA14_DriverIRQHandler
    def_irq_handler    DMA15_DriverIRQHandler
    def_irq_handler    DMA_Error_DriverIRQHandler
    def_irq_handler    MCM_IRQHandler
    def_irq_handler    FTFA_IRQHandler
    def_irq_handler    FTFA_Collision_IRQHandler
    def_irq_handler    PMC_IRQHandler
    def_irq_handler    LLWU_IRQHandler
    def_irq_handler    WDOG_EWM_IRQHandler
    def_irq_handler    Reserved39_IRQHandler
    def_irq_handler    I2C0_DriverIRQHandler
    def_irq_handler    Reserved41_IRQHandler
    def_irq_handler    SPI0_DriverIRQHandler
    def_irq_handler    Reserved43_IRQHandler
    def_irq_handler    Reserved44_IRQHandler
    def_irq_handler    Reserved45_IRQHandler
    def_irq_handler    Reserved46_IRQHandler
    def_irq_handler    UART0_RX_TX_DriverIRQHandler
    def_irq_handler    UART0_ERR_DriverIRQHandler
    def_irq_handler    UART1_RX_TX_DriverIRQHandler
    def_irq_handler    UART1_ERR_DriverIRQHandler
    def_irq_handler    Reserved51_IRQHandler
    def_irq_handler    Reserved52_IRQHandler
    def_irq_handler    Reserved53_IRQHandler
    def_irq_handler    ADC_ERR_IRQHandler
    def_irq_handler    ADCA_IRQHandler
    def_irq_handler    CMP0_IRQHandler
    def_irq_handler    CMP1_IRQHandler
    def_irq_handler    FTM0_IRQHandler
    def_irq_handler    FTM1_IRQHandler
    def_irq_handler    Reserved60_IRQHandler
    def_irq_handler    Reserved61_IRQHandler
    def_irq_handler    Reserved62_IRQHandler
    def_irq_handler    Reserved63_IRQHandler
    def_irq_handler    PIT0_IRQHandler
    def_irq_handler    PIT1_IRQHandler
    def_irq_handler    PIT2_IRQHandler
    def_irq_handler    PIT3_IRQHandler
    def_irq_handler    PDB0_IRQHandler
    def_irq_handler    Reserved69_IRQHandler
    def_irq_handler    XBARA_IRQHandler
    def_irq_handler    PDB1_IRQHandler
    def_irq_handler    DAC0_IRQHandler
    def_irq_handler    MCG_IRQHandler
    def_irq_handler    LPTMR0_IRQHandler
    def_irq_handler    PORTA_IRQHandler
    def_irq_handler    PORTB_IRQHandler
    def_irq_handler    PORTC_IRQHandler
    def_irq_handler    PORTD_IRQHandler
    def_irq_handler    PORTE_IRQHandler
    def_irq_handler    SWI_IRQHandler
    def_irq_handler    Reserved81_IRQHandler
    def_irq_handler    ENC0_COMPARE_IRQHandler
    def_irq_handler    ENC0_HOME_IRQHandler
    def_irq_handler    ENC0_WDOG_SAB_IRQHandler
    def_irq_handler    ENC0_INDEX_IRQHandler
    def_irq_handler    CMP2_IRQHandler
    def_irq_handler    FTM3_IRQHandler
    def_irq_handler    Reserved88_IRQHandler
    def_irq_handler    ADCB_IRQHandler
    def_irq_handler    Reserved90_IRQHandler
    def_irq_handler    CAN0_ORed_Message_buffer_DriverIRQHandler
    def_irq_handler    CAN0_Bus_Off_DriverIRQHandler
    def_irq_handler    CAN0_Error_DriverIRQHandler
    def_irq_handler    CAN0_Tx_Warning_DriverIRQHandler
    def_irq_handler    CAN0_Rx_Warning_DriverIRQHandler
    def_irq_handler    CAN0_Wake_Up_DriverIRQHandler
    def_irq_handler    PWMA_CMP0_IRQHandler
    def_irq_handler    PWMA_RELOAD0_IRQHandler
    def_irq_handler    PWMA_CMP1_IRQHandler
    def_irq_handler    PWMA_RELOAD1_IRQHandler
    def_irq_handler    PWMA_CMP2_IRQHandler
    def_irq_handler    PWMA_RELOAD2_IRQHandler
    def_irq_handler    PWMA_CMP3_IRQHandler
    def_irq_handler    PWMA_RELOAD3_IRQHandler
    def_irq_handler    PWMA_CAP_IRQHandler
    def_irq_handler    PWMA_RERR_IRQHandler
    def_irq_handler    PWMA_FAULT_IRQHandler
    def_irq_handler    CMP3_IRQHandler
    def_irq_handler    Reserved109_IRQHandler
    def_irq_handler    CAN1_ORed_Message_buffer_DriverIRQHandler
    def_irq_handler    CAN1_Bus_Off_DriverIRQHandler
    def_irq_handler    CAN1_Error_DriverIRQHandler
    def_irq_handler    CAN1_Tx_Warning_DriverIRQHandler
    def_irq_handler    CAN1_Rx_Warning_DriverIRQHandler
    def_irq_handler    CAN1_Wake_Up_DriverIRQHandler

    .end
